WRansohoff/FPM-C_STM32_Example/src/global.h
#ifndef _VVC_GLOBAL_H
#define _VVC_GLOBAL_H

#include <errno.h>
#include <stdint.h>
#include <string.h>

#ifdef VVC_F0
  #include "stm32f0xx.h"
  #include "stm32f0xx_hal_conf.h"
#elif VVC_F1
  #include "stm32f1xx.h"
  #include "stm32f1xx_hal_conf.h"
#elif  VVC_L0
  #include "stm32l0xx.h"
  #include "stm32l0xx_hal_conf.h"
#elif  VVC_L4
  #include "stm32l4xx.h"
  #include "stm32l4xx_hal_conf.h"
#endif

#include "fpm.h"

// Global defines.
#ifdef VVC_F1
  #define Po_LED   (GPIOC)
  #define Pi_LED   (13)
  #define Po_U1TX  (GPIOA)
  #define Pi_U1TX  (9)
  #define Po_U1RX  (GPIOA)
  #define Pi_U1RX  (10)
  #define Po_U2TX  (GPIOA)
  #define Pi_U2TX  (2)
  #define Po_U2RX  (GPIOA)
  #define Pi_U2RX  (3)
  #define FPM_UART (USART2)
  #define P_UART   (USART1)
#else
  #define Po_LED   (GPIOB)
  #define Pi_LED   (3)
  #define Po_U1RX  (GPIOA)
  #define Pi_U1RX  (10)
  #define AF_U1RX  (7)
  #define Po_U1TX  (GPIOA)
  #define Pi_U1TX  (9)
  #define AF_U1TX  (7)
  #define Po_U2TX  (GPIOA)
  #define Pi_U2TX  (2)
  #define AF_U2TX  (7)
  #define Po_U2RX  (GPIOA)
  #define Pi_U2RX  (15)
  #define AF_U2RX  (3)
  #define FPM_UART (USART1)
  #define P_UART   (USART2)
#endif

// Global variables.
extern uint32_t SystemCoreClock;
extern volatile uint32_t millis;

// Fingerprint reader values.
FPM fprint;
FPM_System_Params fprint_params;

#endif
